#include <iostream>
/*
Задано матрицю цілих чисел, яка складається з 4 рядків та 4 стовпчиків. Знайти суму додатних та кількість від’ємних елементів матриці.  Обробку матриці  виконати  в  окремій  функції  (функціях),  матрицю,  що  обробляється, передати в функцію як параметр.
*/

void Work(int mass[][4],int size)
{
  //ініціалізуємо змінні та присвоюємо їм значення 0
  int summa_dodatnix=0,kolvo_negativ=0;
  /*
  1.Організовуємо цикл для прохождення по масиву розмірності 4
  2.Виводимо елементи масиву
  3.Підраховуємо суму додатніх елементів та кількість від’ємних
 */
 
  for(int i=0;i<size;i++) 
   {
   for(int j=0;j<size;j++)
   {
     if(mass[i][j]>=0)
     {
       summa_dodatnix+=mass[i][j];
     }
     else 
     {
       kolvo_negativ+=1;
     }
   }
   }
   std::cout<<"Сума додатніх елементів = "<<summa_dodatnix<<std::endl;
   std::cout<<"Кількість від’ємних елементів = "<<kolvo_negativ;

}
int main() {
  const int n=4;
  int arr[n][n];
  setlocale(0,"rus");
  std::cout<<"Масив:\n";
  //заповнення та відображення
  for(int i=0;i<n;i++) 
   {
   for(int j=0;j<n;j++)
   {
     arr[i][j]=rand()%100-20;
     std::cout<<arr[i][j]<<"\t";
   }
   std::cout<<"\n";
   }
   //виклик функції обробки масиву
  Work(arr,n);
  
}
